#### CodeCheckingParameterServiceData Members

---

|  |
| --- |
| CodeCheckingParameterServiceData Class   Methods   Properties   See Also |

The  CodeCheckingParameterServiceData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  CodeCheckingParameterServiceData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetCurrentElements | Returns the list of Ids of the current elements. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Document | The current document. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

CodeCheckingParameterServiceData Class

Autodesk.Revit.DB.Structure Namespace